In [1]:
import pandas as pd
import numpy as np

In [2]:
import warnings
warnings.filterwarnings("ignore")

# Answer The Questions..

### Q.1 Add, subtract, multiple and divide two series of Pandas.

In [3]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([5,6,7,12,24])

print(s1 + s2)
print(s1 - s2)
print(s1 * s2)
print(s1 / s2)

0     6
1     8
2    10
3    16
4    29
dtype: int64
0    -4
1    -4
2    -4
3    -8
4   -19
dtype: int64
0      5
1     12
2     21
3     48
4    120
dtype: int64
0    0.200000
1    0.333333
2    0.428571
3    0.333333
4    0.208333
dtype: float64

### Q.2 Compare the elements of the two Pandas Series.

In [7]:
Series1 = [2, 4, 6, 8, 10]
Series2 = [1,2,3,4,5]

print(Series1 == Series2)

False

### Q.3 Convert a dictionary to a Pandas series.

In [8]:
dict_1 = {'A': 5, 
          'B': 10, 
          'C':15, 
          'D':20, 
          'E':25}

print(dict_1)

{'A': 5, 'B': 10, 'C': 15, 'D': 20, 'E': 25}

In [9]:
Series = pd.Series(dict_1)
Series

A     5
B    10
C    15
D    20
E    25
dtype: int64

### Q.4 Convert a NumPy array to a Pandas series.

In [10]:
array = np.array([12,24,35,45,53,65])
array

array([12, 24, 35, 45, 53, 65])

In [12]:
Series = pd.Series(array)
Series

0    12
1    24
2    35
3    45
4    53
5    65
dtype: int32

### Q.5 Create a series then  add some data to an existing Series.

In [13]:
ex = pd.Series([1,2,3,4,5])
ex

ex_2 = pd.Series([6,7,8,9])
ex_2

print(ex.append(ex_2))

0    1
1    2
2    3
3    4
4    5
0    6
1    7
2    8
3    9
dtype: int64

### Q.6  Find the mean and standard deviation of a given Series.

In [15]:
Series = pd.Series(range(1,30,3))
Series

print(Series.std())
print(Series.mean())

9.082951062292475
14.5

### Q.7 Create and display a DataFrame from a specified dictionary data which has the index labels.

In [26]:
student  =   {'Name': ['smith', 'dona', 'Katherine', 'john', 'roman', 'ross', 'Matthew', 'joey', 'monica', 'rachel'],
                'Grade': [9, 9, 8.3, 7.3, 4, 5, 6.5, 7.9, 7.5, 8.5],
                'Country': ['USA', 'USA', 'AUS', 'USA', 'AUS', 'USA', 'Can', 'AUS', 'Can', 'yes'],
                'eligibility': ['eligible', 'eligible', 'Not eligible', 'Not eligible', 'eligible','eligible', 'eligible', 'eligible', 'Not eligible', 'Not eligible']}
student  

add_labels = ['A','B','C','D','E','F','G','H','I','J']

df = pd.DataFrame(student,index=add_labels)
df

        Name  Grade Country   eligibility
A      smith    9.0     USA      eligible
B       dona    9.0     USA      eligible
C  Katherine    8.3     AUS  Not eligible
D       john    7.3     USA  Not eligible
E      roman    4.0     AUS      eligible
F       ross    5.0     USA      eligible
G    Matthew    6.5     Can      eligible
H       joey    7.9     AUS      eligible
I     monica    7.5     Can  Not eligible
J     rachel    8.5     yes  Not eligible

### Q.8 Select the 'name' and 'Grade' columns from Student dataframe (Q.7 dataframe)

In [29]:
df[['Name','Grade']]

        Name  Grade
A      smith    9.0
B       dona    9.0
C  Katherine    8.3
D       john    7.3
E      roman    4.0
F       ross    5.0
G    Matthew    6.5
H       joey    7.9
I     monica    7.5
J     rachel    8.5

### Q.9 Get the first 3 rows from Student dataframe (Q.7 dataframe)

In [30]:
df.iloc[0:4,:]

        Name  Grade Country   eligibility
A      smith    9.0     USA      eligible
B       dona    9.0     USA      eligible
C  Katherine    8.3     AUS  Not eligible
D       john    7.3     USA  Not eligible

### Q.10 Select the rows where the number of Grade is greater than 8 from Student dataframe (Q.7 dataframe)

In [33]:
df[df.Grade > 8]

        Name  Grade Country   eligibility
A      smith    9.0     USA      eligible
B       dona    9.0     USA      eligible
C  Katherine    8.3     AUS  Not eligible
J     rachel    8.5     yes  Not eligible

### Q.11 Change the Grade in row D to 8.6. from Student dataframe (Q.7 dataframe)

In [35]:
df.loc['D','Grade'] = 8.6
df

        Name  Grade Country   eligibility
A      smith    9.0     USA      eligible
B       dona    9.0     USA      eligible
C  Katherine    8.3     AUS  Not eligible
D       john    8.6     USA  Not eligible
E      roman    4.0     AUS      eligible
F       ross    5.0     USA      eligible
G    Matthew    6.5     Can      eligible
H       joey    7.9     AUS      eligible
I     monica    7.5     Can  Not eligible
J     rachel    8.5     yes  Not eligible

### Q.12  Calculate the sum of Grade by the students. from Student dataframe (Q.7 dataframe)

In [36]:
df.Grade.sum()

74.3

### Q.13 Calculate the mean Grade for each different student in data frame.

In [45]:
df.Grade.mean()

7.43

### Q.14  Sort the data frame first by 'Name' in descending order, then by 'Grade' in ascending order.

In [46]:
df.sort_values(by = ["Name","Grade"],ascending=[False,True])

        Name  Grade Country   eligibility
A      smith    9.0     USA      eligible
F       ross    5.0     USA      eligible
E      roman    4.0     AUS      eligible
J     rachel    8.5     yes  Not eligible
I     monica    7.5     Can  Not eligible
D       john    8.6     USA  Not eligible
H       joey    7.9     AUS      eligible
B       dona    9.0     USA      eligible
G    Matthew    6.5     Can      eligible
C  Katherine    8.3     AUS  Not eligible

### Q.15 Replace the eligibility column contains the values 'eligibility' and 'Not eligible' with YES and NO.

In [53]:
df.eligibility = df.eligibility.replace(to_replace={'eligible':'Yes','Not eligible':'No'})
df

        Name  Grade Country eligibility
A      smith    9.0     USA         Yes
B       dona    9.0     USA         Yes
C  Katherine    8.3     AUS          No
D       john    8.6     USA          No
E      roman    4.0     AUS         Yes
F       ross    5.0     USA         Yes
G    Matthew    6.5     Can         Yes
H       joey    7.9     AUS         Yes
I     monica    7.5     Can          No
J     rachel    8.5     yes          No

### Q.16 Join the two given dataframes along rows and assign all data.

In [58]:
emp_1 = pd.DataFrame({
        'emp_id': [1, 2, 3, 4, 5],
         'name': ['Same','Ross', 'Mike','Roman','Smith',], 
        'Salary': [13222, 10300, 19000, 22332, 19900]})

emp_2 = pd.DataFrame({
        'emp_id': [6,7,8,9,10],
        'name': ['Scarlette', 'Williamson', 'Morse', 'Kaiser', 'Preston'], 
        'Salary': [12201, 23200, 13198, 11219, 10201]})

total_emp = pd.concat([emp_1,emp_2])
total_emp

   emp_id        name  Salary
0       1        Same   13222
1       2        Ross   10300
2       3        Mike   19000
3       4       Roman   22332
4       5       Smith   19900
0       6   Scarlette   12201
1       7  Williamson   23200
2       8       Morse   13198
3       9      Kaiser   11219
4      10     Preston   10201

### Q.17 Write a Pandas program to append given rows to an existing DataFrame emp_1 and display the combined data.

In [62]:
series = pd.Series([12,'Mike',349985],index=['emp_id', 'name', 'Salary'])
combined_data = emp_1.append(series,ignore_index=True)
combined_data

   emp_id   name  Salary
0       1   Same   13222
1       2   Ross   10300
2       3   Mike   19000
3       4  Roman   22332
4       5  Smith   19900
5      12   Mike  349985

### Q.18 Write a Pandas program to append a list of dictioneries  existing DataFrame Emp_2 and display the combined data.

In [63]:
dictionary = [{'emp_id':11,'name':'Luis','Salary':22356}]
dictionary

[{'emp_id': 11, 'name': 'Luis', 'Salary': 22356}]

In [64]:
combined_data = emp_2.append(dictionary,ignore_index=True)
combined_data

   emp_id        name  Salary
0       6   Scarlette   12201
1       7  Williamson   23200
2       8       Morse   13198
3       9      Kaiser   11219
4      10     Preston   10201
5      11        Luis   22356

### Q.19 Write a Pandas program to join the two dataframes using the common column of both dataframes.

In [65]:
emp_1 = pd.DataFrame({
        'emp_id': [1, 2, 3, 4, 5],
         'name': ['Same','Ross', 'Mike','Roman','Smith',], 
        'Salary': [13222, 10300, 19000, 22332, 19900]})

emp_2 = pd.DataFrame({
        'emp_id': [4,5,8,9,10],
        'name': ['Scarlette', 'Williamson', 'Morse', 'Kaiser', 'Preston'], 
        'Salary': [12201, 23200, 13198, 11219, 10201]})

In [67]:
display(emp_1,emp_2)

   emp_id   name  Salary
0       1   Same   13222
1       2   Ross   10300
2       3   Mike   19000
3       4  Roman   22332
4       5  Smith   19900

   emp_id        name  Salary
0       4   Scarlette   12201
1       5  Williamson   23200
2       8       Morse   13198
3       9      Kaiser   11219
4      10     Preston   10201

In [71]:
emp_1.join(emp_2,on = 'emp_id',how='inner',lsuffix='_x',rsuffix='_y')

   emp_id  emp_id_x name_x  Salary_x  emp_id_y      name_y  Salary_y
0       1         1   Same     13222         5  Williamson     23200
1       2         2   Ross     10300         8       Morse     13198
2       3         3   Mike     19000         9      Kaiser     11219
3       4         4  Roman     22332        10     Preston     10201

In [72]:
pd.merge(emp_1,emp_2,on = 'emp_id',how='inner')

   emp_id name_x  Salary_x      name_y  Salary_y
0       4  Roman     22332   Scarlette     12201
1       5  Smith     19900  Williamson     23200

### Q.20 Write a Pandas program to join (left join) the two dataframes using keys from left dataframe only.

In [73]:
data1 = pd.DataFrame({'Year': [2020,2020,2020,2020,2020],
                     'Week': ['A', 'B', 'B', 'C','D'],
                     'Colour': ['Red', 'Red', 'Black', 'Red','Green'],
                     'Val1': [50,60,70,10,20]}) 

data2 = pd.DataFrame({'Year': [2020,2020,2020,2020,2020],
                     'Week': ['A', 'B', 'C', 'C','D'],
                     'Colour': ['Black', 'Black', 'Green', 'Red','Red'],
                     'Val1': [30,100,50,20,40]})

In [74]:
display(data1,data2)

   Year Week Colour  Val1
0  2020    A    Red    50
1  2020    B    Red    60
2  2020    B  Black    70
3  2020    C    Red    10
4  2020    D  Green    20

   Year Week Colour  Val1
0  2020    A  Black    30
1  2020    B  Black   100
2  2020    C  Green    50
3  2020    C    Red    20
4  2020    D    Red    40

In [78]:
pd.merge(data1,data2,on = ['Week','Colour'],how = 'left')

   Year_x Week Colour  Val1_x  Year_y  Val1_y
0    2020    A    Red      50     NaN     NaN
1    2020    B    Red      60     NaN     NaN
2    2020    B  Black      70  2020.0   100.0
3    2020    C    Red      10  2020.0    20.0
4    2020    D  Green      20     NaN     NaN

### END ###